In [1]:
#LAB2

In [5]:
import pandas as pd

In [39]:
df=pd.DataFrame()

In [40]:
df['Name']=['Parth','Abc','Pqr','Xyz','John', 'Jane', 'Mike', 'Alice', 'Tom', 'Eva']
df['Age']=[20, 70, 52, 14, 25,35, 45, 55, 65, 75]
df['Gender']=['Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female']

In [41]:
df

    Name  Age  Gender
0  Parth   20    Male
1    Abc   70  Female
2    Pqr   52    Male
3    Xyz   14  Female
4   John   25    Male
5   Jane   35  Female
6   Mike   45    Male
7  Alice   55  Female
8    Tom   65    Male
9    Eva   75  Female

In [42]:
df.iloc[4]

Name      John
Age         25
Gender    Male
Name: 4, dtype: object

In [44]:
df.iloc[1:4]

  Name  Age  Gender
1  Abc   70  Female
2  Pqr   52    Male
3  Xyz   14  Female

In [45]:
df.iloc[:]

    Name  Age  Gender
0  Parth   20    Male
1    Abc   70  Female
2    Pqr   52    Male
3    Xyz   14  Female
4   John   25    Male
5   Jane   35  Female
6   Mike   45    Male
7  Alice   55  Female
8    Tom   65    Male
9    Eva   75  Female

In [46]:
df.iloc[1:4,1:3]

   Age  Gender
1   70  Female
2   52    Male
3   14  Female

In [49]:
df[(df['Gender'].isin(['Male', 'Female'])) & (df['Age'] >= 65)]

  Name  Age  Gender
1  Abc   70  Female
8  Tom   65    Male
9  Eva   75  Female

In [50]:
df.replace("Female","Woman")

    Name  Age Gender
0  Parth   20   Male
1    Abc   70  Woman
2    Pqr   52   Male
3    Xyz   14  Woman
4   John   25   Male
5   Jane   35  Woman
6   Mike   45   Male
7  Alice   55  Woman
8    Tom   65   Male
9    Eva   75  Woman

In [52]:
df['Gender'].replace(["Female","Male"],["Woman","Man"])

0      Man
1    Woman
2      Man
3    Woman
4      Man
5    Woman
6      Man
7    Woman
8      Man
9    Woman
Name: Gender, dtype: object